-- УДАЛЕНИЕ ВСЕХ ДАННЫХ ИЗ БД
delete from
    sessions;

delete from
    user_featured_courses;

delete from
    materials;

delete from
    courses;

delete from
    users;

INSERT INTO
    courses (name, description, semester)
VALUES
    ('Алгоритмы и структуры данных', 'описание', 1),
    ('Иностранный язык', 'описание', 1),
    ('Социология', 'описание', 1),
    ('Физическая культура и спорт', 'описание', 1),
    (
        'Линейная алгебра и аналитическая геометрия',
        'описание',
        1
    ),
    ('Математический анализ', 'описание', 1),
    ('Язык и методы программирования', 'описание', 1),
    ('Основы информатики', 'описание', 1);